{"class_name": "Model", "config": {"output_layers": [["dense_1", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "name": "input_1", "batch_input_shape": [null, 224, 224, 3]}, "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "activity_regularizer": null, "strides": [2, 2], "trainable": true, "kernel_regularizer": null, "filters": 32, "activation": "linear", "bias_regularizer": null, "name": "conv1"}, "name": "conv1"}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "center": true, "name": "conv1_bn", "scale": true, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv1_bn"}, {"inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "conv1_relu"}, "name": "conv1_relu"}, {"inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "depth_multiplier": 1, "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "strides": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "depthwise_regularizer": null, "name": "conv_dw_1", "trainable": true, "activation": "linear", "bias_regularizer": null, "depthwise_constraint": null}, "name": "conv_dw_1"}, {"inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "center": true, "name": "conv_dw_1_bn", "scale": true, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv_dw_1_bn"}, {"inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "conv_dw_1_relu"}, "name": "conv_dw_1_relu"}, {"inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "filters": 64, "activation": "linear", "bias_regularizer": null, "name": "conv_pw_1"}, "name": "conv_pw_1"}, {"inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "center": true, "name": "conv_pw_1_bn", "scale": true, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv_pw_1_bn"}, {"inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "conv_pw_1_relu"}, "name": "conv_pw_1_relu"}, {"inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "depth_multiplier": 1, "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "strides": [2, 2], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "depthwise_regularizer": null, "name": "conv_dw_2", "trainable": true, "activation": "linear", "bias_regularizer": null, "depthwise_constraint": null}, "name": "conv_dw_2"}, {"inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "center": true, "name": "conv_dw_2_bn", "scale": true, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv_dw_2_bn"}, {"inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "conv_dw_2_relu"}, "name": "conv_dw_2_relu"}, {"inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "filters": 128, "activation": "linear", "bias_regularizer": null, "name": "conv_pw_2"}, "name": "conv_pw_2"}, {"inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "center": true, "name": "conv_pw_2_bn", "scale": true, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv_pw_2_bn"}, {"inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "conv_pw_2_relu"}, "name": "conv_pw_2_relu"}, {"inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "depth_multiplier": 1, "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "strides": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "depthwise_regularizer": null, "name": "conv_dw_3", "trainable": true, "activation": "linear", "bias_regularizer": null, "depthwise_constraint": null}, "name": "conv_dw_3"}, {"inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "center": true, "name": "conv_dw_3_bn", "scale": true, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv_dw_3_bn"}, {"inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "conv_dw_3_relu"}, "name": "conv_dw_3_relu"}, {"inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "filters": 128, "activation": "linear", "bias_regularizer": null, "name": "conv_pw_3"}, "name": "conv_pw_3"}, {"inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "center": true, "name": "conv_pw_3_bn", "scale": true, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv_pw_3_bn"}, {"inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "conv_pw_3_relu"}, "name": "conv_pw_3_relu"}, {"inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "depth_multiplier": 1, "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "strides": [2, 2], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "depthwise_regularizer": null, "name": "conv_dw_4", "trainable": true, "activation": "linear", "bias_regularizer": null, "depthwise_constraint": null}, "name": "conv_dw_4"}, {"inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "center": true, "name": "conv_dw_4_bn", "scale": true, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv_dw_4_bn"}, {"inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "conv_dw_4_relu"}, "name": "conv_dw_4_relu"}, {"inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "filters": 256, "activation": "linear", "bias_regularizer": null, "name": "conv_pw_4"}, "name": "conv_pw_4"}, {"inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "center": true, "name": "conv_pw_4_bn", "scale": true, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv_pw_4_bn"}, {"inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "conv_pw_4_relu"}, "name": "conv_pw_4_relu"}, {"inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "depth_multiplier": 1, "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "strides": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "depthwise_regularizer": null, "name": "conv_dw_5", "trainable": true, "activation": "linear", "bias_regularizer": null, "depthwise_constraint": null}, "name": "conv_dw_5"}, {"inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "center": true, "name": "conv_dw_5_bn", "scale": true, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv_dw_5_bn"}, {"inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "conv_dw_5_relu"}, "name": "conv_dw_5_relu"}, {"inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "filters": 256, "activation": "linear", "bias_regularizer": null, "name": "conv_pw_5"}, "name": "conv_pw_5"}, {"inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "center": true, "name": "conv_pw_5_bn", "scale": true, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv_pw_5_bn"}, {"inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "conv_pw_5_relu"}, "name": "conv_pw_5_relu"}, {"inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "depth_multiplier": 1, "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "strides": [2, 2], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "depthwise_regularizer": null, "name": "conv_dw_6", "trainable": true, "activation": "linear", "bias_regularizer": null, "depthwise_constraint": null}, "name": "conv_dw_6"}, {"inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "center": true, "name": "conv_dw_6_bn", "scale": true, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv_dw_6_bn"}, {"inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "conv_dw_6_relu"}, "name": "conv_dw_6_relu"}, {"inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "filters": 512, "activation": "linear", "bias_regularizer": null, "name": "conv_pw_6"}, "name": "conv_pw_6"}, {"inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "center": true, "name": "conv_pw_6_bn", "scale": true, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv_pw_6_bn"}, {"inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "conv_pw_6_relu"}, "name": "conv_pw_6_relu"}, {"inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "depth_multiplier": 1, "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "strides": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "depthwise_regularizer": null, "name": "conv_dw_7", "trainable": true, "activation": "linear", "bias_regularizer": null, "depthwise_constraint": null}, "name": "conv_dw_7"}, {"inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "center": true, "name": "conv_dw_7_bn", "scale": true, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv_dw_7_bn"}, {"inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "conv_dw_7_relu"}, "name": "conv_dw_7_relu"}, {"inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "filters": 512, "activation": "linear", "bias_regularizer": null, "name": "conv_pw_7"}, "name": "conv_pw_7"}, {"inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "center": true, "name": "conv_pw_7_bn", "scale": true, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv_pw_7_bn"}, {"inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "conv_pw_7_relu"}, "name": "conv_pw_7_relu"}, {"inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "depth_multiplier": 1, "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "strides": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "depthwise_regularizer": null, "name": "conv_dw_8", "trainable": true, "activation": "linear", "bias_regularizer": null, "depthwise_constraint": null}, "name": "conv_dw_8"}, {"inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "center": true, "name": "conv_dw_8_bn", "scale": true, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv_dw_8_bn"}, {"inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "conv_dw_8_relu"}, "name": "conv_dw_8_relu"}, {"inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "filters": 512, "activation": "linear", "bias_regularizer": null, "name": "conv_pw_8"}, "name": "conv_pw_8"}, {"inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "center": true, "name": "conv_pw_8_bn", "scale": true, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv_pw_8_bn"}, {"inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "conv_pw_8_relu"}, "name": "conv_pw_8_relu"}, {"inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "depth_multiplier": 1, "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "strides": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "depthwise_regularizer": null, "name": "conv_dw_9", "trainable": true, "activation": "linear", "bias_regularizer": null, "depthwise_constraint": null}, "name": "conv_dw_9"}, {"inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "center": true, "name": "conv_dw_9_bn", "scale": true, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv_dw_9_bn"}, {"inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "conv_dw_9_relu"}, "name": "conv_dw_9_relu"}, {"inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "filters": 512, "activation": "linear", "bias_regularizer": null, "name": "conv_pw_9"}, "name": "conv_pw_9"}, {"inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "center": true, "name": "conv_pw_9_bn", "scale": true, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv_pw_9_bn"}, {"inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "conv_pw_9_relu"}, "name": "conv_pw_9_relu"}, {"inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "depth_multiplier": 1, "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "strides": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "depthwise_regularizer": null, "name": "conv_dw_10", "trainable": true, "activation": "linear", "bias_regularizer": null, "depthwise_constraint": null}, "name": "conv_dw_10"}, {"inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "center": true, "name": "conv_dw_10_bn", "scale": true, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv_dw_10_bn"}, {"inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "conv_dw_10_relu"}, "name": "conv_dw_10_relu"}, {"inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "filters": 512, "activation": "linear", "bias_regularizer": null, "name": "conv_pw_10"}, "name": "conv_pw_10"}, {"inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "center": true, "name": "conv_pw_10_bn", "scale": true, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv_pw_10_bn"}, {"inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "conv_pw_10_relu"}, "name": "conv_pw_10_relu"}, {"inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "depth_multiplier": 1, "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "strides": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "depthwise_regularizer": null, "name": "conv_dw_11", "trainable": true, "activation": "linear", "bias_regularizer": null, "depthwise_constraint": null}, "name": "conv_dw_11"}, {"inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "center": true, "name": "conv_dw_11_bn", "scale": true, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv_dw_11_bn"}, {"inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "conv_dw_11_relu"}, "name": "conv_dw_11_relu"}, {"inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "filters": 512, "activation": "linear", "bias_regularizer": null, "name": "conv_pw_11"}, "name": "conv_pw_11"}, {"inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "center": true, "name": "conv_pw_11_bn", "scale": true, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv_pw_11_bn"}, {"inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "conv_pw_11_relu"}, "name": "conv_pw_11_relu"}, {"inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "depth_multiplier": 1, "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "strides": [2, 2], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "depthwise_regularizer": null, "name": "conv_dw_12", "trainable": true, "activation": "linear", "bias_regularizer": null, "depthwise_constraint": null}, "name": "conv_dw_12"}, {"inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "center": true, "name": "conv_dw_12_bn", "scale": true, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv_dw_12_bn"}, {"inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "conv_dw_12_relu"}, "name": "conv_dw_12_relu"}, {"inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "filters": 1024, "activation": "linear", "bias_regularizer": null, "name": "conv_pw_12"}, "name": "conv_pw_12"}, {"inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "center": true, "name": "conv_pw_12_bn", "scale": true, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv_pw_12_bn"}, {"inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "conv_pw_12_relu"}, "name": "conv_pw_12_relu"}, {"inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"dilation_rate": [1, 1], "depth_multiplier": 1, "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "strides": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "depthwise_regularizer": null, "name": "conv_dw_13", "trainable": true, "activation": "linear", "bias_regularizer": null, "depthwise_constraint": null}, "name": "conv_dw_13"}, {"inbound_nodes": [[["conv_dw_13", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "center": true, "name": "conv_dw_13_bn", "scale": true, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv_dw_13_bn"}, {"inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "conv_dw_13_relu"}, "name": "conv_dw_13_relu"}, {"inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "filters": 1024, "activation": "linear", "bias_regularizer": null, "name": "conv_pw_13"}, "name": "conv_pw_13"}, {"inbound_nodes": [[["conv_pw_13", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "center": true, "name": "conv_pw_13_bn", "scale": true, "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv_pw_13_bn"}, {"inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "conv_pw_13_relu"}, "name": "conv_pw_13_relu"}, {"inbound_nodes": [[["conv_pw_13_relu", 0, 0, {}]]], "class_name": "GlobalAveragePooling2D", "config": {"data_format": "channels_last", "trainable": true, "name": "global_average_pooling2d_1"}, "name": "global_average_pooling2d_1"}, {"inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "class_name": "Reshape", "config": {"target_shape": [1, 1, 1024], "trainable": true, "name": "reshape_1"}, "name": "reshape_1"}, {"inbound_nodes": [[["reshape_1", 0, 0, {}]]], "class_name": "Dropout", "config": {"seed": null, "trainable": true, "noise_shape": null, "rate": 0.6, "name": "dropout"}, "name": "dropout"}, {"inbound_nodes": [[["dropout", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "filters": 1000, "activation": "linear", "bias_regularizer": null, "name": "conv_preds"}, "name": "conv_preds"}, {"inbound_nodes": [[["conv_preds", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "act_softmax"}, "name": "act_softmax"}, {"inbound_nodes": [[["act_softmax", 0, 0, {}]]], "class_name": "Reshape", "config": {"target_shape": [1000], "trainable": true, "name": "reshape_2"}, "name": "reshape_2"}, {"inbound_nodes": [[["reshape_2", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "name": "1000fc", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "units": 1000, "trainable": true, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}}, "name": "1000fc"}, {"inbound_nodes": [[["1000fc", 0, 0, {}]]], "class_name": "Dropout", "config": {"seed": null, "trainable": true, "noise_shape": null, "rate": 0.2, "name": "Dropout_1"}, "name": "Dropout_1"}, {"inbound_nodes": [[["Dropout_1", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "name": "dense_1", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "units": 4, "trainable": true, "kernel_regularizer": null, "activation": "softmax", "bias_regularizer": null}, "name": "dense_1"}]}, "backend": "tensorflow", "keras_version": "2.1.2"}